In [3]:
import pandas as pd

### Pandas Append
Pandas Append will add a piece of data to another DataFrame. This means adding data2 to data1 so you get data1+data2. This is very similar to regular python append.

Let's run through 4 examples:
1. Appending multiple rows - Appending a DataFrame to a DataFrame
2. Appending a single row - Appending a Series to a DataFrame
3. Appending a single row - Appending a Dictionary to a DataFrame
4. Appending a multiple rows - Appending a list of Dictionaries to a DataFrame

First, let's create 2 DataFrames

In [4]:
df1 = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )

df2 = pd.DataFrame([('The Riddler', 'Restaurant', 29.02),
                   ('Smitten Ice Cream', 'Restaurant', 98.60),
                   ('Suppenkuche', 'Restaurant', 40.23),
                   ('Maven', 'bar', 45.20)],
           columns=('name', 'type', 'AvgBill')
                 )

print (df1)
print ()
print (df2)

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

                name        type  AvgBill
0        The Riddler  Restaurant    29.02
1  Smitten Ice Cream  Restaurant    98.60
2        Suppenkuche  Restaurant    40.23
3              Maven         bar    45.20

### 1. Appending multiple rows - Appending a DataFrame to a DataFrame
Here we are going to append df2 to df1. This means we will put df2 at the bottom of df1.

In [5]:
df1.append(df2)

                name        type  AvgBill
0     Foreign Cinema  Restaurant   289.00
1          Liho Liho  Restaurant   224.00
2           500 Club         bar    80.50
3         The Square         bar    25.30
0        The Riddler  Restaurant    29.02
1  Smitten Ice Cream  Restaurant    98.60
2        Suppenkuche  Restaurant    40.23
3              Maven         bar    45.20

Notice how the index from df2 transfered over to the resulting DataFrame (row 5 has an index label=0). If we wanted the regular index to continue, then we set *ignore_index=True*

In [6]:
df1.append(df2, ignore_index=True)

                name        type  AvgBill
0     Foreign Cinema  Restaurant   289.00
1          Liho Liho  Restaurant   224.00
2           500 Club         bar    80.50
3         The Square         bar    25.30
4        The Riddler  Restaurant    29.02
5  Smitten Ice Cream  Restaurant    98.60
6        Suppenkuche  Restaurant    40.23
7              Maven         bar    45.20

### 2. Appending a single row - Appending a Series to a DataFrame
Now in this case, I want to append a single row (instead of a whole DataFrame) to another DataFrame. In this example I'll use a pandas series. You'll need to make sure that your series index labels match up to the DataFame columns.

In [7]:
my_series = pd.Series(data=['SuppenKuche', 'Restaurant', 100.32], index=['name', 'type', 'AvgBill'])
my_series

name       SuppenKuche
type        Restaurant
AvgBill         100.32
dtype: object

In [8]:
df1.append(my_series, ignore_index=True)

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4     SuppenKuche  Restaurant   100.32

### 3. Appending a single row - Appending a Dictionary to a DataFrame
Here, instead of a Series, I'll pass a python *dictionary.* The keys will need to match up to your DataFrame's column names

In [9]:
my_dictionary = {'name' : 'Nojo Tavern', 'type' : 'Restaurant', 'AvgBill' : 50.32}
my_dictionary

{'name': 'Nojo Tavern', 'type': 'Restaurant', 'AvgBill': 50.32}

In [10]:
df1.append(my_dictionary, ignore_index=True)

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4     Nojo Tavern  Restaurant    50.32

### 4. Appending a multiple rows - Appending a list of Dictionaries to a DataFrame
You can also pass a list of Series or a list of Dictionaries to append multiple rows.

In [11]:
my_dictionary_list = [{'name' : 'Fort Point', 'type' : 'Bar', 'AvgBill' : 20.42},
                      {'name' : 'The Gring', 'type' : 'Restaurant', 'AvgBill' : 14.32},
                      {'name' : 'Cafe Reveille', 'type' : 'Cafe', 'AvgBill' : 19.89}]
my_dictionary_list

[{'name': 'Fort Point', 'type': 'Bar', 'AvgBill': 20.42},
 {'name': 'The Gring', 'type': 'Restaurant', 'AvgBill': 14.32},
 {'name': 'Cafe Reveille', 'type': 'Cafe', 'AvgBill': 19.89}]

In [12]:
df1.append(my_dictionary_list, ignore_index=True)

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4      Fort Point         Bar    20.42
5       The Gring  Restaurant    14.32
6   Cafe Reveille        Cafe    19.89

### Bonus: When you pass column names that don't align with the original DataFrame
If you pass *new* column names in your DataFrame, Series, or Dict, then *new* columns will be made on your original DataFrame. I wish pandas had an option to exclude these new columns as an optional parameter, but that's life.

In [13]:
my_dictionary_new_columns = {'Place_name' : 'Nojo Tavern', 'type' : 'Restaurant', 'AvgBill' : 50.32}
my_dictionary_new_columns

{'Place_name': 'Nojo Tavern', 'type': 'Restaurant', 'AvgBill': 50.32}

In [15]:
df1.append(my_dictionary_new_columns, ignore_index=True)

             name        type  AvgBill   Place_name
0  Foreign Cinema  Restaurant   289.00          NaN
1       Liho Liho  Restaurant   224.00          NaN
2        500 Club         bar    80.50          NaN
3      The Square         bar    25.30          NaN
4             NaN  Restaurant    50.32  Nojo Tavern